# FabricationRodInfo Methods (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
FabricationRodInfo Methods
FabricationRodInfo Class See Also
---
The FabricationRodInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AttachToHanger | Attaches the hanger rod to another bearer hanger. |
| AttachToStructure | Attaches to the nearest structural element. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBearerExtension | Gets the bearer extension. The method is applicable only for bearer hanger. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetRodAttachedElementId | Gets the id of the attached component for the specified rod. |
| GetRodEndPosition | Gets the position of the rod end. |
| GetRodLength | Get the current rod length. If the rod is the length will include structural extension. |
| GetRodStructureExtension | Gets the length of the rod's top extension into structure. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsRodLockedWithHost | Checks if the rod is locked with the host. The method is applicable only for bearer hanger. |
| SetBearerExtension | Sets the bearer extension. The method is applicable only for bearer hanger. |
| SetRodEndPosition | Sets the position of the rod end. The method is applicable only for bearer hanger. |
| SetRodLength | Set the rod length of the hanger for the specified rod index, excluding top extension. The hanger must not be set to be auto-hosted. |
| SetRodLockedWithHost | Locks the rod with the host. The method is applicable only for bearer hanger. |
| SetRodStructureExtension | Set the length of the rod's top extension into structure. The rod must be attached to structure. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace